knielsen/ice40-stm32-sdram/stm32/main.c
  for(;;) {
    led1_on();
    for (i = 0; i < 0x10000; ++i) {
      write_sdram(i<<1, i&0xffff);
    }
    led1_off();
    led2_on();
    j = 0;
    for (i = 0; i < 0x10000; ++i) {
      uint16_t v = read_sdram(i<<1);
      if (v != (i&0xffff)) {
        ++j;
        if (j <= 10) {
          serial_puts(USART1, "  ");
          serial_output_hex(USART1, i);
          serial_puts(USART1, "  ");
          print_uint32(USART1, v);
          serial_puts(USART1, " != ");
          print_uint32(USART1, (i&0xffff));
          serial_puts(USART1, "\r\n");
        }
      }
    }
    led2_off();
    serial_puts(USART1, "Errors: ");
    println_uint32(USART1, j);

    delay(MCU_HZ/3);
  }
}


__attribute__((unused))
static void
ice40_sdram_test6(void)
{
  uint32_t i;

  i = 0;
  for(;;) {
    uint16_t v1, v2;

    led1_on();
    write_sdram(0, i&0xffff);
    write_sdram(8, (~i)&0xffff);
    v2 = read_sdram(8);
    v1 = read_sdram(0);
    serial_output_hex(USART1, i);
    serial_puts(USART1, "  ");
    serial_output_hex(USART1, v1);
    serial_puts(USART1, " ");
    serial_output_hex(USART1, v2);
    serial_puts(USART1, "\r\n");
    led1_off();

    ++i;
    delay(MCU_HZ/3);
  }
}


__attribute__((unused))
static void
ice40_sdram_test7(void)
{
  uint32_t i, j;

  i = 0;
  for(;;) {
    uint16_t v1, v2;

    led1_on();
    for (j = 0; j < 24; ++j) {
      write_sdram((1<<j)<<1, i&0xffff);
      write_sdram(0, (~i)&0xffff);
    }
    for (j = 0; j < 24; ++j) {
      v1 = read_sdram((1<<j)<<1);
      v2 = read_sdram(0);
      print_uint32(USART1, j);
      serial_puts(USART1, "  ");
      serial_output_hex(USART1, v1);
      serial_puts(USART1, "  ");
      serial_output_hex(USART1, v2);
      serial_puts(USART1, "\r\n");
    }
    led1_off();

    ++i;
    delay(MCU_HZ/3);
  }
}


/*
  Mem-test a range of adresses. Repeatedly write values and re-read to check
  if the same values can be read back.
*/
__attribute__((unused))
static void
ice40_sdram_test8(void)
{
  static const uint32_t TOP = (1<<24);
  uint32_t i, j;
  uint32_t errors, first_error_adr, first_error_val, first_error_expected;

  i = 0;
  for(;;) {
    led1_on();
    for (j = 0; j < TOP; ++j) {
      //uint32_t byte_adr = ( ((j&0xffffff00)<<1) | (j&0xff) )<<1;
      uint32_t byte_adr = j<<1;
      uint16_t v = (i+j+(j>>8)+(j>>16)+(j>>24)) & 0xffff;
      write_sdram(byte_adr, v);
    }
    errors = 0;
    first_error_adr = 0;
    first_error_val = 0;
    first_error_expected = 0;
    for (j = 0; j < TOP; ++j) {
      //uint32_t byte_adr = ( ((j&0xffffff00)<<1) | (j&0xff) )<<1;
      uint32_t byte_adr = j<<1;
      uint16_t expected = (i+j+(j>>8)+(j>>16)+(j>>24)) & 0xffff;
      uint16_t v = read_sdram(byte_adr);
      if (v != expected) {
        if (errors == 0) {
          first_error_adr = byte_adr>>1;
          first_error_val = v;
          first_error_expected = expected;
        }
        ++errors;
      }
    }

    serial_output_hex(USART1, i);
    serial_puts(USART1, "  Errors: ");
    print_uint32(USART1, errors);
    serial_puts(USART1, "  adr=");
    serial_output_hex(USART1, first_error_adr);
    serial_puts(USART1, "  val=");
    serial_output_hex(USART1, first_error_val);
    serial_puts(USART1, "  expected=");
    serial_output_hex(USART1, first_error_expected);
    serial_puts(USART1, "\r\n");
    ++i;
    led1_off();

    delay(MCU_HZ/3);
  }
}


__attribute__((unused))
static void
ice40_sdram_test9(void)
{
  for(;;) {
    uint16_t v1, v2;
    static const uint32_t a8_row_word = 1<<(8+2+9+1);

    write_sdram(0+a8_row_word, 0xffff);
    write_sdram(512+a8_row_word, 0x0000);
    v1 = read_sdram(0+a8_row_word);
    v2 = read_sdram(512+a8_row_word);

/*
    serial_output_hex(USART1, v1);
    serial_puts(USART1, "  ");
    serial_output_hex(USART1, v2);
    serial_puts(USART1, "\r\n");
*/
    delay(MCU_HZ/3);
  }
}


static void
fsmc_manual_init(void)
{
  FSMC_NORSRAMInitTypeDef fsmc_init;
  FSMC_NORSRAMTimingInitTypeDef timing, alttiming;
  GPIO_InitTypeDef GPIO_InitStructure;

  /* GPIOD, E, F, and G clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5|
    GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_11|
    GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource0, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource1, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource4, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource5, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource7, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource10, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource11, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource12, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource13, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_FSMC);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|
    GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_11|
    GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOE, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource0, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource1, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource3, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource4, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource7, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource8, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource9, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource10, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource11, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource12, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource13, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource14, GPIO_AF_FSMC);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource15, GPIO_AF_FSMC);

